<a href="https://colab.research.google.com/github/Niranjan-Kumar2001/Exercise/blob/main/User.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Step 1. Import the necessary libraries**

In [1]:
#Importing the necessary libraries

import pandas as pd
import numpy as np

# Step 2. Import the dataset from this address.
# Step 3. Assign it to a variable called users and use the 'user_id' as index

In [2]:
#Getting the dataset and reading the csv file with a seperator as "|" and setting the index as user_id
url='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
user=pd.read_csv(url,sep='|')
user=user.set_index('user_id')

# Step 4. See the first 25 entries

In [3]:
#Using head function getting the first 25 records
user.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

# Step 5. See the last 10 entries

In [4]:
#Using the tail function we can get the last 10 records
user.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# Step 6. What is the number of observations in the dataset?

In [5]:
#Using the count function to get the number of rows in each column
user.count()

age           943
gender        943
occupation    943
zip_code      943
dtype: int64

# Step 7. What is the number of columns in the dataset?

In [6]:
#Using the len fuction we get the number of column by extracting only the column using the 'columns' function 
len(user.columns)

4

# Step 8. Print the name of all the columns.

In [7]:
#Using the column function we get the column in the dataframe and converting it to a list to show the names in a list format 
user.columns.tolist()

['age', 'gender', 'occupation', 'zip_code']

# Step 9. How is the dataset indexed?

In [8]:
#Using the index function to get the indexes of the dataframe
user.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

# Step 10. What is the data type of each column?

In [9]:
#Using the dtypes we can get the datatype of the column in the dataframe
user.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# Step 11. Print only the occupation column

In [10]:
#Using the dot or [''] we can specify the action on that column 
user.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# Step 12. How many different occupations are in this dataset?

In [11]:
#Using the group by function we are grouping up the records on occupation columns
user.groupby('occupation').occupation.count()

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
Name: occupation, dtype: int64

In [12]:
#Getting the number of distinct occupation in the data set
user.occupation.nunique()

21

# Step 13. What is the most frequent occupation?

In [13]:
#Getting the most frequent occupation by sorting the values in descending order and using the head function to get the first record only
user.groupby('occupation').occupation.count().sort_values(ascending=False).head(1).index[0]

'student'

# Step 14. Summarize the DataFrame.

In [14]:
#Using the describe function to get the summary of the dataframe 
user.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

# Step 15. Summarize all the columns

In [15]:
#Specifying include as all to get the summary of all the columns in the dataframe
user.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

# Step 16. Summarize only the occupation column

In [16]:
#Getting the summary of onnly the occupation column 
user.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

# Step 17. What is the mean age of users?

In [17]:
#Getting the mean of the ages using the mean function
user.age.mean()

34.05196182396607

# Step 18. What is the age with least occurrence?

In [18]:
#Getting the  occurance of age by using value_count and the least occurance of that by using tail function 
user.age.value_counts().tail()

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64

# Step 19. Write a lambda function to convert a string column to a numerical column

In [19]:
#Convert age which is a integer datatype to string
user.age=user.age.map(str)
user.dtypes

age           object
gender        object
occupation    object
zip_code      object
dtype: object

In [20]:
#Using the lambda function we are converting the age which is a string to numeric 
s_t_n=lambda x:pd.to_numeric(x)
user.age=user.age.apply(s_t_n)

In [21]:
user.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**Alternate** **Method**

In [22]:
#Creating a dictonary and changing the value of M and F to 1 or 0 using the lambda function
gen={'M':1,'F':0}

user.gender=user.gender.apply(lambda x:gen[x])

user.head()

         age  gender  occupation zip_code
user_id
1         24       1  technician    85711
2         53       0       other    94043
3         23       1      writer    32067
4         24       1  technician    43537
5         33       0       other    15213

In [23]:
user.dtypes

age            int64
gender         int64
occupation    object
zip_code      object
dtype: object